[
{
      "title":"The Better Workplace Conference 2015",
      "description":"“It was the best of times, it was the worst of times.” “Let’s ensure that the future workplace is a better workplace.” In the last few years, employee engagement has risen to become a priority for organizations across Canada. As employers turn their focus to building better workplaces, we all face an uncertain future. Many see a new world of opportunity opening up as a new generation rises to leadership in organizations. At the same time, small, innovative companies are driving the HR and corporate agenda with their employee-focused policies. Employees are looking for greater freedom and many employers are delivering through initiatives such as Results Only Work Environments or the Holocracy of organizations such as Zappos and Netflix. Yet, despite this, many see themselves and their colleagues overworked as they face the multiple demands of an always-on workplace. For 18 years this event has driven a discussion about wellness, change, and corporate culture—aimed at creating a more engaged and healthier workforce. Other events address aspects of this issue, but only at The Better Workplace Conference will you hear from the top change and wellness practitioners. The unrivalled variety of the presentations and workshops offer the opportunity for new ways of seeing and doing that will deliver results for you and your employer. This event has one aim—to equip you with the tools you need to ensure your future workplace is a better workplace. To address this issue we are reviewing numerous speaker submissions and looking for those speakers who can deliver practical solutions. Among the wellness, change, and culture topics under consideration are: Changing culture through coaching Mindfulness at work Preventing bullying in the workplace How to turn downtime into uptime Balancing work and family Using gamification to increase employee engagement Can theatre help you change your culture? Making better workplaces through better decisions Putting happiness at the heart of business Positivity at work Driving innovation through diversity Culture change in the real world Making a success of virtual teams Building resilience Creating the mentally healthy workplace Bridging the generations in the workplace Identifying workplace factors that have the most impact on health and wellness We’d like to thank our generous sponsors for their contribution to this event.                       View it now"}
]
