[
         {
            "name":"Peter R. Aceto",
            "professionalTitle":"President and Chief Executive Officer, Tangerine Bank",
            "bio":"Peter Aceto, President and Chief Executive Officer of Tangerine Bank, is a passionate leader. For more than 16 years he held various senior leadership positions at ING DIRECT, including president and Chief Executive Officer from 2008-2013. Peter leads the cornerstones of success for Tangerine Bank with a relentless focus which includes a simple and efficient business model, an winning and adaptable strategy, outstanding client service, risk management, return and growth, and building a solid team to execute the company\u0027s vision.Peter is a sought out speaker, a social media leader and contributes biweekly to his blog on Forward Thinking. He was profiled in Forbes Magazine as the Social CEO, and Huffington Post as one of the top 50 Social CEO\u0027s on Twitter. He was also named 2012 Business Person of the Year by Western Law School. Peter is involved with numerous charities including Covenant House and Mount Sinai Hospital.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Bruce Ballon",
            "professionalTitle":"Associate Professor of Public Health and Psychiatry, University of Toronto",
            "bio":"Dr. Bruce Ballon is an Associate Professor of Public Health and Psychiatry for the University of Toronto\u0027s Faculty of Medicine and Adjunct Professor for the University Of Ontario Institute Of Technology\u0027s Faculty of Health Sciences. Dr. Ballon also is an Academic Educator for the Centre for Faculty Development at the University of Toronto. Dr. Ballon has received numerous national and international awards and peer-reviewed grants for his work in medical simulation, addiction psychiatry, psychotherapy, education, the humanities, and his writing.As Director of Education for SIM-one (the Simulation Network of Ontario), which encompasses all the health centres and training programs in Ontario, Dr. Ballon has designed numerous workshops, events, expositions, certification programs and more for advancing the uptake and innovation of simulation across healthcare. In this role he promotes the embedding of inter professionalism and patient safety in education and training.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Mary Ann Baynton",
            "professionalTitle":"Program Director, The Great-West Life Centre for Mental Health in the Workplace",
            "bio":"Mary Ann proudly serves as the Program Director for the Great-West Life Centre for Mental Health in the Workplace which is part of the company\u0027s public commitment to help employers of all types, not just its customers, address psychological health and safety in their workplaces. The Centre provides free, practical ideas, and tools to help with the prevention, intervention and management of workplace mental health issue. The Centre also hosts forums and roundtables to discuss issues, support new research, and partner in the creation of new resources.Mary Ann is a chair of the technical committee for the National Standard of Canada on Psychological Health and Safety in the Workplace and serves on the expert panel for the three year case study research project of the Mental Health Commission of Canada.As the principal of Mary Ann Baynton \u0026 Associates Mary Ann provides consulting services to governments, organizations and unions that wish to improve or address issues related to workplace mental health. These services include individual return to work planning, conflict mediation, keynotes and workshops customized to meet the specific needs of the group.Mary Ann is author of Resolving Workplace Issues, Keeping Well at Work and Mindful Manager. She is also co-author with Dr. Martin Shain of Preventing Workplace Meltdown: An employer\u0027s guide to providing a psychologically safe workplace.Mary Ann latest venture is the launch of Mindful Employer Canada, a not-for-profit that celebrates the public commitment of employers and managers to support positive workplace mental health.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"John Brewer",
            "professionalTitle":"Executive Program Developer, The Conference Board of Canada",
            "bio":"John Brewer is the owner of Idea Exchange, and has over 20 years\u0027 experience producing conferences on change, human resources, diversity, IT, pensions, risk, compensation, and project management. John has been developing events for The Conference Board of Canada since 2000. His current focus is on innovation, diversity, community, and the human aspects of change and risk management.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Donna Burnett-Vachon",
            "professionalTitle":"Associate Director, Leadership and Organizational Development Research, The Conference Board of Canada",
            "bio":"Donna Burnett Vachon is an Associate Director with the Leadership and Human Resources Research Division of The Conference Board of Canada. Since joining the Board in October 2011, Donna has been actively involved in research in the areas of leadership, leadership development frameworks and practices, succession planning , the advancement of women leaders, and learning and development.Donna has 17 years operational experience in Human Resources Management and Organization Development. Prior to joining the Board, Donna held senior positions in Human Resources Management and Organization Development in industries including healthcare, high tech and manufacturing.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Louise Chénier",
            "professionalTitle":"Manager, Workplace Health and Wellness Research, The Conference Board of Canada",
            "bio":"Louise Chénier is a Manager of Workplace Health and Wellness Research, with The Conference Board of Canada. Louise is also the Network Manager for the Council on Workplace Health and Wellness - an exclusive network of organizational health management leaders from private and public sector organizations across Canada. Since she joined the Conference Board seven years ago, Louise has participated in research on strategic human resources management, employee health, wellness, and safety, and diversity and inclusion in the workplace. She has recently completed a research project on disability management in the workplace.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"David Couper",
            "professionalTitle":"Chief Executive Officer, David Couper Counsulting",
            "bio":"David Couper is Founder and CEO of David Couper Consulting, Inc., a strategic effectiveness consulting firm focusing on the real bottom-line in business: PEOPLE. Through his 20+ years of experience as a globe-trotting business leader and published writer, David has come to believe in the power of personal vision and its ability to move mountains. He knows that when businesses forget their vision, their workforce also loses theirs. David educates leaders to know that successful organizations ignite an employee\u0027s drive to contribute, create, and flourish.David\u0027s prolific career has taken him from London to Tokyo, Chicago to Los Angeles, Latin America and back. Partnering with Fortune 500 business leaders to resuscitate the soul of work from the inside out, his talent and approach have had profound impact in the sectors of healthcare, media, entertainment, manufacturing, finance, and oil and gas.As a self-proclaimed \"Successful Misfit,\" David continues to celebrate individuality in life and work, and his latest book had the same title. This book is in addition to his collection of fiction and non-fiction books, most of which have been translated into Swedish, Polish, and Danish and have been published in the UK and the US. His passion for communicating his vision of individual empowerment and authentic corporate success have made him a regular guest on television, radio, print, and online outlets such as NPR, Forbes, CBS News, and Newsweek Japan.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Jennifer Elia",
            "professionalTitle":"Assistant Vice-President, Health and Wellness, Group Benefits, Sun Life Financial",
            "bio":"Jennifer Elia is Assistant Vice-President, Health and Wellness, Group Benefits at Sun Life Financial. With over 15 years of experience, Jennifer\u0027s career has included roles in disability management, strategic planning and product development. She joined Sun Life in 2009 to help establish the Health and Wellness business before moving to Human Resources where she led the design and delivery of market leading benefits and wellness programs. She leads a strong team of health and wellness experts focused on meeting the healthy workplace objectives of Canadian employers. She is passionate about integrating group benefits and wellness programs. Jennifer is a graduate of the Workplace Wellness and Health Promotion program at Centennial College and has an honors degree in Health and Psychology from Queen\u0027s University.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Tony Gareri",
            "professionalTitle":"Chief Executive Officer-Chief of Wow, Roma Moulding",
            "bio":"As Chief Executive Officer (CEO) or Chief of WOW as he is known to his team members, Tony Gareri led Roma through an extraordinary company culture transformation that has affirmed Roma Moulding as an industry leader while simultaneously becoming renowned for outstanding company culture. Only four years ago, with the world still reeling from the financial meltdown, Gareri found himself in a crisis. He woke up one day to discover that he hated his job at the family business, which he had been groomed to someday run. A chance encounter led him to discover an alternative to the traditional view that \"work had to hurt.\"Since then, Gareri has developed and tested practical methods to improve company culture and has helped some of North America\u0027s most iconic brands on his journey. He has delivered numerous keynote presentations, is an avid blogger and frequent contributor to The Globe and Mail. He has been featured in Forbes magazine, named one of 2014\u0027s Most Passionate Leaders by esteemed author Carmine Gallo and serves as a culture mentor to multiple Great Places To Work Canada winners. Gareri emphatically believes, \"When you bring together great people, a leading brand and an insanely great culture; magical things happen.\"",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"David Gilman",
            "professionalTitle":"Internal OD Consultant, Vision Essentials Kaiser Permanente",
            "bio":"For the past 30 years, David J. Gilman has cultivated his expertise in staff development at Kaiser Permanente, a healthcare organization that serves over four million members. His accomplishments include the designing, development and implementation of various innovative staff development curriculum that establishes and reinforces the company\u0027s mission and brand.David has also developed a variety of management and employee tools that have augmented the success of these programs and created a collaborative culture that ultimately fosters creativity and long-term commitment within a labor manager partnership environment.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Peter B. Gove",
            "professionalTitle":"Innovation Leader, Health Management, Green Shield Canada",
            "bio":"Peter Gove, Innovation leader, Health management with Green Shield Canada (GSC), has oversight for initiatives under GSC\u0027s Change4Lifeÿ banner. Change4Lifeÿ is aimed at supporting Canadians to better manage their health. The initiative utilizes advanced analytics to proactively identify plan participants who are at risk of developing, or who have developed a chronic disease and to reach out to them with focused programs.Prior to coming to GSC, Peter was responsible for the national disability management and life insurance claims program for a large Canadian life insurance company.Mr. Gove has a master\u0027s degree in social work and is a registered social worker. Continuing his education, he started a PhD program in Applied Health Science at the University of Waterloo. He has presented internationally in the areas of health management and disability management and was the recipient of the 2014 Vision and Values Award presented by the Canadian Life and Health Insurance Association.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Jamie A Gruman",
            "professionalTitle":"Associate Professor, Organizational Behaviour, University of Guelph",
            "bio":"Jamie Gruman is an Associate Professor in the Department of Management at the University of Guelph, where his research focuses largely on positive organizational psychology, and the on-boarding of new employees.Jamie is also a founding member and Chair of the Board of Directors of the Canadian Positive Psychology Association. He has consulted and delivered seminars for Fortune 500 corporations, public, and not-for-profit organizations including General Motors, the Canadian Federal Government, and the Children\u0027s Wish Foundation.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Jack Hourigan",
            "professionalTitle":"Principal, Sway Partners Inc.",
            "bio":"Jack Hourigan is the co-founder of Sway Partners Inc., a boutique learning and communications firm dedicated to harnessing the power of human connection. Jack is a McGill University and Second City Alumna, writer and television host with more than 20 years experience in the communications field.She was the first parent to participate in Family Integrated Care (FICare) at Toronto\u0027s Mount Sinai Hospital in 2011 with her micro preemie daughter Tess. Jack was then hired on staff as the FICare Parent Coordinator - speaking, training and advocating for Patient and Family Centered Care across North America. She volunteers as a peer support facilitator for the Canadian Premature Babies Foundation (CPBF).",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Deri J. Latimer",
            "professionalTitle":"Chief Executive Officer, Positivity Speaking",
            "bio":"From an isolated northern community to the TEDx stage, Deri Latimer has learned how to \u0027bounce\u0027 through her life! Turning personal tragedy into purposeful passion, Deri transforms research on human performance to deliver a message that is loaded with simplicity and practical application. Her client resources reflect her down-to-earth approach, including two books \u0027Wake Up To Your Habits\u0027 and \u0027What\u0027s Your Story? You Decide\u0027 and an APP called \u0027Mood Manager\u0027.One of fewer than 12% of speakers globally who hold the designation of CSP (Certified Speaking Professional), Deri works with organizations who want to create happy, healthy, humane workplaces for increased positivity, productivity, and prosperity!",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Jason Little",
            "professionalTitle":"Organizational Change Coach, Leanintuit",
            "bio":"Jason Little is an Organizational Change Coach, international speaker and author. Jason has been working in the software industry for 17 years as a developer through to Director level management and now works as an agent of change.In 2012 Jason released \"Agile Transformation: A Guide to Organizational Change\" on InformIT and Safari Books Online, won the Lean Startup Toronto weekend competition and won best Lean Startup talk at LESS 2012 in Tallin, Estonia. His passion is the people side of change and he is currently working on bridging the gap between the Agile and change management worlds.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Graham S. Lowe",
            "professionalTitle":"President, The Graham Lowe Group Inc.",
            "bio":"Graham Lowe is the President of The Graham Lowe Group Inc., a workplace consulting and research firm, and a Professor Emeritus at the University of Alberta. Graham has three decades of organizational, labour market, and employment policy consulting experience across Canada and internationally. His latest book is Creating Healthy Organizations. Graham regularly contributes articles to practitioner publications such as Canadian HR Reporter, Health \u0026 Productivity Management, HR Professional, and Healthcare Quarterly. As a \"thought leader\" on work issues, he has given hundreds of conference talks and workshops and is a frequent media commentator. Graham is a recipient of the Canadian Workplace Wellness Pioneer Award.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Rona Maynard",
            "professionalTitle":"Speaker and Author, Rona Maynard was Editor of Chatelaine when she broke a secret she\u0027d been keeping all her life-her history of chronic depression. Letters poured in from hundreds of people who feared losing their jobs or their loved ones\u0027 respect. When a suicide call turned up on her office voicemail, she knew she had found her mission.",
            "bio":"Rona\u0027s early advocacy of a neglected cause won her a National Champion of Mental Health Award. Her other personal honors include a YWCA Woman of Distinction Award, a Woman of Action Award from the Israel Cancer Research Foundation and a Media Award from the Canadian Nurses Association. Under Rona\u0027s leadership, Chatelaine was honored internationally for health reporting, design, newsstand sales and overall excellence.Rona left Chatelaine to write the book her readers had been asking for-the memoir My Mother\u0027s Daughter, which Alice Munro has called \"wonderfully honest and enthralling.\" Now at work on a second book, she runs storytelling workshops for business people and first-time memoirists.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Catherine Morisset",
            "professionalTitle":"Resilience Specialist, Imagine Plus",
            "bio":"Catherine Morisset is passionate about her work, and it shows in her refreshing approach to resilience, based on building reserves and preparedness for today\u0027s and tomorrow\u0027s challenges. She believes we can aim for more than coping with work and life: we deserve to thrive. Catherine\u0027s core belief is that we all have access to being well and being resilient; she inspires action through a down-to-earth and effective approach, anchored in small steps and common sense.Catherine works with governments, national and international organizations, providing customized resilience expertise at every level, improving morale and productivity for a fast-paced world, and decreasing the burden of chronic stress and burnout on people and organizations.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Ellen Morita",
            "professionalTitle":"Principal, Sway Partners Inc.",
            "bio":"Ellen is a co-founder of Sway Partners Inc., a boutique learning and communications firm dedicated to harnessing the power of human connection. Prior to founding Sway Partners, Ellen was an executive at one of Canada\u0027s top financial organizations. Her 20 plus years of corporate experience spans sales, product development, training, operations, and business strategy.Ellen currently serves as a cabinet member for the Lighthouse Legacy Campaign and is the former board President of Our Place Peel. Like so many working Moms, Ellen spends an unrealistic amount of time shuttling her boys to arenas, fields and courts to keep them off their iPads.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Jennifer Moss",
            "professionalTitle":"Chief Marketing Officer, Plasticity Labs",
            "bio":"Jennifer Moss, Chief Marketing Officer of Plasticity Labs, consults leaders using data for good and is on a mission to give 1 billion people the tools to live a happier, higher-performing life. In her role, Jennifer consults leadership teams on their strategic business planning by helping them to build and improve emotional intelligence throughout entire organizations.Jennifer has 18 years of professional experience in Marketing and Public Relations with nine years based in Silicon Valley. She has received a series of professional accolades throughout her career including; The National Public Service Award from the Office of President Obama and most recently the 2014 International Female Entrepreneur of the Year Stevieÿ Award.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Jim Moss",
            "professionalTitle":"Chief Executive Officer, Plasticity Labs",
            "bio":"Jim Moss, Chief Executive Officer of Plasticity Labs, consults leaders using data for good and is on a mission to give 1 billion people the tools to live a happier, higher-performing life. In his role, Jim consults leadership teams on their strategic business planning by helping them to build and improve emotional intelligence throughout entire organizations.Jim is a former gold-medal winning professional athlete, and Canadian Hall of Fame inductee. His high-level understanding of sports psychology and intrinsic self-motivation heavily influences his coaching approach. Jim strives to pass on this highly ingrained work ethic to motivate business leaders in their efforts to reach their personal and professional potential. He has been profiled in media around the globe including: The Wall Street Journal, Canadian Business Magazine and TechCrunch, among others.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Joy Noonan",
            "professionalTitle":"Principal and Owner, Aptus Conflict Solutions Inc.",
            "bio":"Joy Noonan was called to the Ontario Bar 1991 and was, up until 2007, a senior partner for a major Canadian law firm. In 2007 Joy shifted her law practice to that of a full-time neutral. She is the co-owner of APTUS Conflict Solutions Inc. (Ottawa/Toronto) and has been designated by the ADR Institute of Canada as a Chartered Mediator. She is also a long-time mindfulness practitioner, and has recently joined the ranks of the world-renowned corporate mindfulness training group, \u0027The Potential Project\u0027. The Potential Project has developed a Corporate-Based Mindfulness Training Program (CBMT) tailor-made to meet the specific challenges of corporate life. It promotes an approach to mindful awareness for busy people with little time and a hectic work life: tough deadlines, endless emails, and high demands on time, energy and flexibility.In addition to her work with APTUS and also on behalf of The Potential Project, Joy teaches and lectures on mediation process, workplace investigations, human rights and employment-related issues, sits on the legal studies advisory committee for Algonquin College, and acts as an Ambassador for Women for Mental Health Initiative (Royal Ottawa Hospital).",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"William Pallett",
            "professionalTitle":"President, WJ Pallett \u0026 Associates",
            "bio":"William Pallett was most recently, prior to establishing his own company, the Senior Vice President of People Resources for Delta Hotels and Resorts. Mr. Pallett was responsible with guiding the Human Resources function, focusing on training, organization and management development, employee relations, total rewards, health \u0026 wellness, career development, and developing / implementing / reviewing all human resource initiatives, procedures and policies in order that they reflected Delta\u0027s objective; to be the best employer \u0027of choice\u0027 in the Canadian hospitality industry. Prior to this role, William was Director of Management Development for Four Seasons Hotels. In that position, he stewarded training initiatives in virtually every aspect of management for hotels throughout North America. He has also held senior human resources positions in such organizations as Wardair Canada (now part of Air Canada), Canadian Pacific Hotels \u0026 Resorts (now known at Fairmont Hotels and Resorts and Rogers. He has also been a senior consultant specializing in management development and recruitment.A sought-after speaker / lecturer, Mr. Pallett has taught Business Administration and Human Resources Management related subjects at the British Columbia Institute of Technology in Vancouver and Ryerson Polytechnic University in Toronto. He has been a frequent guest speaker to numerous professional associations as well as private industry groups throughout Canada and the United States.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Michael J. Rouse",
            "professionalTitle":"Professor, Western University, Ivey Business School Strategy and Organization",
            "bio":"Dr. Michael J. Rouse is the principal investigator for the Sun Life- Ivey Canadian Wellness ROI study. Michael is associate professor, strategy and organization at the Ivey Business School at Western University where he is also cross-appointed in Epidemiology and Biostatistics at the Schulich School of Medicine. His research has been published in prestigious academic journals such as the Strategic Management Journal, Management Learning, the Journal of World Business, Implementation Science, and the Journal of Public Health Policy. He has served as guest editor for two academic journals and has co-authored five books, one of which - Strategic Analysis and Action - is in its ninth edition.Michael is the lead on Ivey\u0027s executive client projects India, and serves as academic director of Ivey\u0027s Healthcare Management Executive MBA program in China. Michael has been honored with multiple teaching awards including the prestigious David G Burgoyne Teaching Award for Outstanding Commitment to Student Development.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Ross Roxburgh",
            "professionalTitle":"Executive Director, The Niagara Institute",
            "bio":"Ross Roxburgh heads the Conference Board’s Niagara Institute through which leadership programs are offered.Ross has worked in the fields of organizational change, human resources, leadership coaching and development and change management for more than 35 years. Prior to joining Deloitte \u0026 Touche LLP, he worked in human resource management roles in the university sector as well as the transit and telecommunications industries. With Deloitte Ross helped to build strong Human Capital practices in Ottawa and Toronto. Ross was a Deloitte Partner for fourteen years, leaving the Firm in 2000 to establish his own practice.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Dan Rubenstein",
            "professionalTitle":"Writer and Walker, borntowalk.org",
            "bio":"Dan Rubinstein is a National Magazine Award-winning writer and editor, and the author of Born to Walk: The Transformative Power of a Pedestrian Act. After more than two decades as a journalist, he found himself at a personal and professional crossroads and decided to spend a few years exploring the curative properties of walking, from physical and mental health to social cohesion and economic possibilities. Born to Walk has been called \"thought-provoking and transcendent\" by , and \"a necessary, convincing book\" by Toronto\u0027s chief planner.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Tim Sitt",
            "professionalTitle":"Founder and Owner, MOVE",
            "bio":"Tim Sitt is a Health and Wellness Consultant and the creator of Think MOVE, an innovative health and wellness program that addresses the problem of being sedentary at the workplace. Tim is embarking on a mission to change the prominent sedentary culture to help corporations and organizations engage employees to be healthier and more energized through movement. His background as a Personal Trainer and Psychotherapist makes him well suited for creating the MOVE program that integrates physical and mental health.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Sean Slater",
            "professionalTitle":"Executive Vice-President, Sales and Marketing, Homewood Health Inc.",
            "bio":"Sean Slater is the Executive Vice President of Sales and Marketing with Homewood Health. In his role, Sean is responsible for providing leadership in the development and execution of market and customer strategies across all product and customer segments. He leads teams that have responsibility for customer service, marketing and communications, and sales.To his role, Sean brings 15 years of varied experiences gained from senior leadership roles in the Employee Assistance Program (EAP), Wellness, Disability and Employer Services industries. Sean has led teams responsible for integrating and bundling multiple complementary services and products designed to help customer organizations become more efficient, healthy and profitable. His focus has been on supporting customers, clients, insurers and partners in understanding their data, identifying their areas of opportunity, and building solutions that deliver return for the customer and the organization.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Nora Spinks",
            "professionalTitle":"Chief Executive Officer, Vanier Institute of the Family",
            "bio":"Nora Spinks is the Chief Executive Officer of the Vanier Institute of the Family. Nora has over 25 years experience consulting with corporations, governments and community organizations on creating effective, high performing and supportive work environments.Internationally recognized as an authority on diversity, work/life and wellness, Nora has provided leadership development sessions on leveraging workforce diversity, creating healthy high performing workplaces and fostering a climate of inclusion at leading workplaces across Canada and the US. Prior to assuming the role of Chief Executive Officer at the Vanier Institute, Nora was founder and Chief Executive Officer of Work-Life Harmony Enterprises, an international research and consulting firm based in Toronto. Nora blends evidence-based practices with practical strategies and solutions to build capacity, competence and confidence in organizations large and small.",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Anastasia Valentine",
            "professionalTitle":"Vice-President, Marketing, Versature Corp.",
            "bio":"Anastasia Valentine is an award-winning senior business, product and marketing executive working with entrepreneurs, startups and Fortune companies. For over 20 years she has solved problems for organizations by:· making valuable innovation and product investment decisions· creating viable and profitable products· identifying and creating active, passive and services based revenue streams· increasing visibility of a company, products and leadership· targeting and attracting perfect fit customers and partners· empowering customers to be brand evangelists· creating and profitable, revenue generating partnerships· extending reach and increasing influence· competing and winning against key competitors· creating and improving brand recognition· growing and engaging online communities· developing and curating great contentAs an active advisor and mentor to companies, organizations and individuals, she provides strategic guidance and actionable strategies to build and grow businesses.She is a sought after keynote speaker for industry and association conferences on topics such as leadership, technology, innovation, successful launch strategies and digital marketing. Anastasia is a regular contributing subject matter expert to:· The Business Accelerator Lab - www.businessacceleratorlab.com· Online Marketing Manager Magazine - www.ommmagazine.com· MOMeo Magazine - www.momeomagazine.com· Brazen Woman www.brazenwoman.comPast Agenda",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         },
         {
            "name":"Sponsors",
            "professionalTitle":"We’d like to thank our generous sponsors for their contribution to this event., Joint Strategic Partners",
            "pages":[
               "http://www.conferenceboard.ca/conf/betterworkplace/agenda.aspx"
            ]
         }
      ]
