[
{
      "title":"Public Sector Social Media 2015",
      "description":"Learn about the latest developments in using social media to improve communications and engagement. Social media has quickly moved from being a fringe distraction to an essential part of every organization’s communications strategy. Those who dismissed them as fleeting have been emphatically proved wrong. Communications professionals have experienced a revolutionary change in the channels available to them, and social media have transformed the relationship between customers and vendors, citizens and governments, and employers and employees. Social media has also created new communities and avenues of expression for professional and personal interests. Social media’s greatest impact on governments has been in: citizen and employee communication public consultation management generating and evaluating ideas facilitating collaboration and innovation increasing transparency developing policy removing silos that inhibit change delivering vital information during crises or emergencies Communication, consultation, and collaboration will never be the same. Find out how you can make the most of these changes. This event has been reporting from the frontlines of public sector social media for five years. Social media pioneers have shared their insights, experiences, and stories of success and failure, and have inspired and helped participants blaze their own social media trails. From liberation to radicalization—lessons in the power of social media. In 2010, social media itself grabbed headlines, as Twitter - a medium many had dismissed as trivial - emerged as a major channel for the organization of the Arab Spring. Social media had come of age. The most passionate advocates argued that this was, in fact, a “Twitter revolution,” hailing social media itself as a liberating force that would unleash democracy across the globe. The network is mightier than the sword, as it were. Much has changed since then. Twitter has gone mainstream, but now the spotlight is not on social media as tools of liberation, but rather on how ISIS use them to radicalize youth in developed countries such as Canada, the U.S., and the UK. This event will feature global expert Henry Tuck, who will share the experience of Extreme Dialogue, a project using the same tools as the terrorists to reduce the attraction of extremism to today’s youth. What’s new, and what’s next? Social media open up a whole new world of possibilities and, while many channels are well established, new tools are always emerging that promise even greater effectiveness. These new options also present new challenges, and often disrupt existing channels. Meerkat and Periscope have been generating considerable interest recently, and we’ll look into their potential, along with any other new developments that occur between now and October. Such is the nature of social media, that a few months can yield surprising and important changes. What are your greatest social media challenges? What would you like to discuss at this event? Please contact Executive Program Developer John Brewer at brewer@conferenceboard.ca with your questions, challenges, and ideas. Do you have colleagues who are eager to learn about public sector social media, a large Twitter following, plenty of Facebook friends, or loads of LinkedIn connections? If so, we want to hear from you! Bring three colleagues to register with your social media network, and we’ll give you a complimentary pass to the conference! For more information, please connect with Robyn Mia at mia@conferenceboard.ca or 613-526-3090 ext. 445. The Conference Board is Canada’s most respected independent research and conference development organization. Conference Board events attract top public and private sector leaders, and provide an insightful and enlightening learning experience for conference participants.     View it now Learn more Learn more"}
]
