[
         {
            "name":"Kent Aitken",
            "professionalTitle":"Author, cpsrenewal.ca",
            "pages":[
               "http://www.conferenceboard.ca/conf/pssm/agenda.aspx"
            ]
         },
         {
            "name":"Joe Boughner",
            "professionalTitle":"Director, Communications, Association of Canadian Financial Officers",
            "bio":"Joe Boughner is the Director of Communications for the Association of Canadian Financial Officers. In this role, Joe oversees the planning and execution of a communications and engagement strategy targeted at 4,500 public servants as well as the broader stakeholder community.Joe is a seasoned communications executive with almost 15 years of experience in the industry. In his previous role as a strategic consultant for a Canadian digital agency, he helped design and implement digital outreach, marketing and engagement strategies for many of Canada\u0027s leading brands, including Rogers Communications, Suncor Energy and the Rotman School of Management. Joe also serves as the program coordinator for Algonquin College\u0027s social media and digital analytics certificate programs.",
            "pages":[
               "http://www.conferenceboard.ca/conf/pssm/agenda.aspx"
            ]
         },
         {
            "name":"Micah Clark",
            "professionalTitle":"Mission Manager, The SecDev Group",
            "bio":"Micah Clark is Mission Manager at SecDev, a private open intelligence and cyber security provider. Micah manages a team of analysts, developers and data visualizers who deliver social media and other open source analytical solutions to public and private clients in Canada and abroad. Among other subjects, Micah and his team are analysing events in the ISIS conflict region, the growth of civil society in Iran, and organized crime activity the Northern Triangle of Central America.Micah holds a BA in History and Philosophy from Seattle University and the University of St Andrews, and an MA in International Affairs from the Norman Paterson School of International Affairs at Carleton University.",
            "pages":[
               "http://www.conferenceboard.ca/conf/pssm/agenda.aspx"
            ]
         },
         {
            "name":"Lauren Hunter",
            "professionalTitle":"Head, IN-spire, Natural Resources Canada",
            "bio":"Lauren is currently the Head of NRCan\u0027s Innovation Hub, IN·spire - a first-of-its-kind initiative in the Government of Canada. She has over a decade of experience driving change initiatives in the public and private sectors. Lauren has a PhD in multiculturalism and human rights from the University of British Columbia, where she taught in the Women\u0027s Studies undergraduate program and sat as a member of the University\u0027s Board of Governors.",
            "pages":[
               "http://www.conferenceboard.ca/conf/pssm/agenda.aspx"
            ]
         },
         {
            "name":"Satyamoorthy Kabilan",
            "professionalTitle":"Director, National Security and Strategic Foresight, The Conference Board of Canada",
            "bio":"Kabi leads the National Security and Public Safety (NS\u0026PS) team and strategic foresight practice. He provides leadership and oversight to all contract research and executive network activities. Dr Kabilan co-founded and managed two technology start-ups and has been a leader in the UK’s Future Security and Intelligence Outlook Network (FUSION). In addition, he has been involved in developing the UK\u0027s National Counter Terrorism Strategy (CONTEST), supported the capability development of the soon to be established National Crime Agency, and worked on future force development for the UK\u0027s Ministry of Defence.",
            "pages":[
               "http://www.conferenceboard.ca/conf/pssm/agenda.aspx"
            ]
         },
         {
            "name":"Kate Kaminska",
            "professionalTitle":"Research Analyst, Defence Research and Development Canada",
            "bio":"Dr. Kaminska researches issues related to public safety and security on behalf of the Canadian Safety and Security Program, a federal program led by Defence Research and Development Canada\u0027s Centre for Security Science in partnership with Public Safety Canada. With an undergraduate degree in Engineering, a Ph.D. in Physics, and post-graduate experience in applied research, she has expertise in domains ranging from nanotechnology to emergency management and social networks.In 2014, Dr. Kaminska led the development and execution of a Canada-US experiment to evaluate how social media-aided collaboration can enhance situational awareness and improve disaster recovery outcomes. Dr. Kaminska is currently the research lead and project manager for a federally targeted investment project on leveraging social media and digital volunteers in emergency management.",
            "pages":[
               "http://www.conferenceboard.ca/conf/pssm/agenda.aspx"
            ]
         },
         {
            "name":"Michael Kujawski",
            "professionalTitle":"Managing Partner, Centre of Excellence for Public Sector Marketing",
            "bio":"Mike Kujawski is the Managing Partner of the Centre of Excellence for Public Sector Marketing (CEPSM.ca), where he currently works as a senior consultant, trainer and professional speaker for major government, non-profit, and association clients in Canada and around the globe. Mike\u0027s specialty areas include strategic marketing and communication, digital/social media engagement, social network analysis and social behaviour change marketing. His specific niche revolves around helping his clients excel in the modern digital landscape through evidence-based research using social data, and by following a strategic planning process.Mike\u0027s consulting work stretches across 4 continents, and has involved a variety of industries ranging from health and the environment, to engineering and law. The scope of his work often includes organizational re-structuring, risk management, as well as staffing and policy recommendations to support the rapidly evolving digital channel. Some of Mike\u0027s consulting clients include Elections Canada, the Office of the Auditor General, CRTC, Public Safety Canada, Department of National Defence, Region of Peel, Thunder Bay District Health Unit and the Government of Tanzania. Mike is also often asked to provide strategic digital engagement advice to central government agencies in Canada such as the Treasury Board Secretariat, the Privy Council Office and the Senate.",
            "pages":[
               "http://www.conferenceboard.ca/conf/pssm/agenda.aspx"
            ]
         },
         {
            "name":"Trefor L. Munn-Venn",
            "professionalTitle":"President and Chief Executive Officer, Rhapsody Strategies Inc.",
            "pages":[
               "http://www.conferenceboard.ca/conf/pssm/agenda.aspx"
            ]
         },
         {
            "name":"Alex Munter",
            "professionalTitle":"President and Chief Executive Officer, The Children\u0027s Hospital of Eastern Ontario",
            "bio":"Alex Munter is President and Chief Executive Officer of the Children\u0027s Hospital of Eastern Ontario, bringing to the role more than 20 years of leadership in health and social services and an incredible commitment to helping families in our community.Prior to joining CHEO Alex was Chief Executive Officer of the Champlain Local Health Integration Network (LHIN) -- the provincial government agency responsible for planning, integrating and funding health services in the region. Prior to joining the LHIN, he was Executive Director of the Youth Services Bureau (YSB), one of Ontario\u0027s largest accredited children\u0027s mental health agencies. During his tenure, the organization grew by one-third, adding services and expanding its reach. From 2004 to 2010, Alex also taught in French and English at the University of Ottawa as a Visiting Professor in its Faculty of Social Sciences.Alex was a City and Regional Councillor in Ottawa from 1991 to 2003. From 1997 onward, he headed council committees responsible for health and social services with oversight of the city\u0027s $550 million human services budget. While serving as a Councillor, Alex obtained a Bachelor of Social Sciences (magna cum laude) from the University of Ottawa. He holds a professional designation as a Certified Health Executive (CHE) from the Canadian College of Health Leaders.",
            "pages":[
               "http://www.conferenceboard.ca/conf/pssm/agenda.aspx"
            ]
         },
         {
            "name":"Boyd Neil",
            "professionalTitle":"Senior Vice-President and Senior Digital Strategist, Hill+ Knowlton Strategies",
            "bio":"Boyd Neil uses more than 35 years of experience in the public and private sectors as a communication strategist to provide senior-level counsel to a variety of clients. He is skilled in reputation management and managing communications challenges using social and digital platforms. Boyd has conducted social media conversation audits, counselled clients on managing social media crises, and created and implemented social media and digital strategies for organizations in the oil and gas, financial, insurance, nuclear, packaged goods, and non-profit sectors.Boyd teaches social media and reputation management at Ryerson University, social content strategies in Seneca College\u0027s new full time program in social media, and building social web communities in Humber College\u0027s Bachelor of Public Relations. He is an active blogger and speaks frequently on social media trends and reputation management strategies including at such leading conferences as SXSW, NXNE and HPX. .",
            "pages":[
               "http://www.conferenceboard.ca/conf/pssm/agenda.aspx"
            ]
         },
         {
            "name":"Gray O\u0027Byrne",
            "professionalTitle":"Project Lead, IN-spire, Natural Resources Canada",
            "bio":"Gray O\u0027Byrne is the Project Lead for IN-spire with Natural Resources Canada. Prior to joining IN-spire, Gray worked as a geodetic engineer in the Earth Sciences Sector of NRCan; heavily implicated in web renewal. He is a former co-chair of Natural Resources Canada\u0027s Young Professionals Network and he has been working to make open source software as viable a tool inside government as it is on the outside. Gray has a Master\u0027s degree in Physics and Atmospheric Science from Dalhousie University.",
            "pages":[
               "http://www.conferenceboard.ca/conf/pssm/agenda.aspx"
            ]
         },
         {
            "name":"Anastasia Valentine",
            "professionalTitle":"Vice-President, Marketing, Versature Corp.",
            "bio":"Anastasia Valentine is an award-winning senior business, product and marketing executive working with entrepreneurs, startups and Fortune companies. For over 20 years she has solved problems for organizations by:· making valuable innovation and product investment decisions· creating viable and profitable products· identifying and creating active, passive and services based revenue streams· increasing visibility of a company, products and leadership· targeting and attracting perfect fit customers and partners· empowering customers to be brand evangelists· creating and profitable, revenue generating partnerships· extending reach and increasing influence· competing and winning against key competitors· creating and improving brand recognition· growing and engaging online communities· developing and curating great contentAs an active advisor and mentor to companies, organizations and individuals, she provides strategic guidance and actionable strategies to build and grow businesses.She is a sought after keynote speaker for industry and association conferences on topics such as leadership, technology, innovation, successful launch strategies and digital marketing. Anastasia is a regular contributing subject matter expert to:· The Business Accelerator Lab - www.businessacceleratorlab.com· Online Marketing Manager Magazine - www.ommmagazine.com· MOMeo Magazine - www.momeomagazine.com· Brazen Woman www.brazenwoman.com",
            "pages":[
               "http://www.conferenceboard.ca/conf/pssm/agenda.aspx"
            ]
         },
         {
            "name":"The Hon. Jim Watson",
            "professionalTitle":"Mayor, City of Ottawa",
            "bio":"Jim Watson was elected Mayor of the City of Ottawa on October 25, 2010. Mayor Watson has dedicated most of his career to public service in Canada\u0027s Capital. First elected as a Councillor in 1991, he was re-elected in 1994. Three years later he was elected as the youngest Mayor in Ottawa\u0027s history with 82% of the popular vote. In 2003, he was elected as the Member of Provincial Parliament for Ottawa West-Nepean and immediately appointed to cabinet as Minister of Consumer and Business services. In 2005, he was appointed as Ontario\u0027s first Minister of Health Promotion and he successfully implemented the Smoke Free Ontario Act. Re-elected as MPP in 2007, he was promoted to Minister of Municipal Affairs and Housing.An active member of his community, Watson has also served on the boards or as honorary chair of several community organizations, including the Riverside Hospital, the National Arts Centre, the Christmas Exchange of Ottawa and the Forum for Young Canadians. He served as chair of United Way\u0027s 2002 campaign, which raised a record $21 million.Sponsored byMarketing Partners",
            "pages":[
               "http://www.conferenceboard.ca/conf/pssm/agenda.aspx"
            ]
         }
      ]
