[
{
      "name":"Mark Breslin",
      "professionalTitle":"Strategist, Speaker and Bestselling Author",
      "bio":"Renowned for his straight forward presentation style, Mark Breslin is noted as one of the foremost speakers in the nation on change management, workforce development and next generation leadership training. His principles are transferable to diverse industries and are leading companies and individuals to positively change their leadership styles.  Mark has spoken to more than 300,000 people in the U.S., Canada and Caribbean Trade Zone. Clients include Conoco Phillips, INTEL, Irving Oil, Blue Cross, North Western Energy, Flint Hills Resources and many others.",
      "topics":[
         "Business \u0026 Workplace",
         "Innovation \u0026 Change Management",
         "Performance \u0026 Productivity"
      ]
   },
{
      "name":"Liane Davey",
      "professionalTitle":"Group Dynamics Expert, Inspiring Teams to Grow Up, Get Along, and Get Stuff Done",
      "bio":"Liane Davey, Ph.D. is the bestselling author of YOU FIRST: Inspire Your Team to Grow Up, Get Along, and Get Stuff Done. Liane combines her expertise in strategy with her deep insight into group dynamics to create powerful change in top teams. She works to rehabilitate teams that have become toxic and with healthy teams that want to take their performance to the next level.",
      "topics":[
         "Business \u0026 Workplace",
         "Leadership",
         "Motivation \u0026 Inspiration",
         "Performance \u0026 Productivity"
      ]
   },
{
      "name":"Scott Stratten",
      "professionalTitle":"UnMarketing expert",
      "bio":"Scott Stratten is the President of Un-Marketing. He is an expert in Viral, Social, and Authentic Marketing which he calls Un-Marketing. It’s all about positioning yourself as a trusted expert in front of your target market, so when they have the need, they choose you.",
      "topics":[
         "Business \u0026 Workplace",
         "Celebrity \u0026 Bestselling Authors",
         "Innovation \u0026 Change Management",
         "Technology \u0026 Future",
         "Youth \u0026 Campus"
      ]
   },
{
      "name":"Bruce Croxon",
      "professionalTitle":"Entrepreneur, Co-Host of \u0027The Disruptors\u0027 \u0026 Former CBC Dragon",
      "bio":"Croxon was one of the most popular judges on CBC’s hit show Dragons’ Den and is the entrepreneurial co-founder of the revolutionary online dating website Lavalife.",
      "topics":[
         "Business \u0026 Workplace",
         "Celebrity \u0026 Bestselling Authors",
         "Economics \u0026 Finance",
         "Media \u0026 Entertainment"
      ]
   },
{
      "name":"Merge Gupta-Sunderji",
      "professionalTitle":"Turning managers into leaders - specific and practical tools for leadership success",
      "bio":"Merge Gupta-Sunderji has been turning managers into leaders for over 20 years. Tens of thousands of audience members from around the world have participated and enjoyed the experience of learning through Merge’s presentations. As a professional speaker, author, consultant, and radio commentator, she delivers real-world, practical tools and solutions to ensure her clients have what they need to LEAD in today’s competitive world. She’ll empower, engage and inspire your audience to lead with confidence, competence and courage.",
      "topics":[
         "Business \u0026 Workplace",
         "Innovation \u0026 Change Management",
         "Performance \u0026 Productivity"
      ]
   }
]
