[
  {
    "first": {
      "title": "Pathway to a Successful Career in Management!",
      "description": "We all wonder how do some people reach the pinnacle of success … Don’t we? This workshop will be your stepping stone towards achieving that dream, especially in Canada. Together we will see the challenges people face in getting a good role in a company and how to overcome those challenges and achieve success in the fastest possible manner. About the Speaker – Kumresh Krishnmoorthy - Kumarhas a degree in Computer Engineering. He has got more than 15 years of experience in the IT industry and has worked with prestigious organizations like IBM, EDS and HP. During his career span, he has got vast experience ranging from Technical to Analyst to Management. Being PMP certified, Kumar has got clear understanding on the path towards a successful career in Management. ",
      "keyWords": [
        "Business",
        "successful",
        "career",
        "management",
        "prestigious",
        "organizations"
      ]
    },
    "second": {
      "name": "Sam Geist",
      "professionalTitle": "Business management expert and best-selling author"
    }
  },
  {
    "first": {
      "title": "Food Truck Alley - Hamilton",
      "description": "Food Truck Alley is a Food Truck installation on Aberdeen Ave., just east of Longwood Dr. in Hamilton, Ontario. Here you will find all the best area foodtrucks working together to give Hamilton a new and fun way to enjoy amazing FOOD! ",
      "keyWords": [
        "food",
        "truck"
      ]
    },
    "second": {
      "name": "Dana McCauley",
      "professionalTitle": "Food Trend Expert & Every Day Innovator"
    }
  },
  {
    "first": {
      "title": "Buck-a-shuck",
      "description": "Stop by our Seafood Department and slurp down fresh oysters for only $1 each! Our Fishmongers will shuck these savory shellfish for you, fresh on the spot!. Get'em while they last! Toppings available.*Promotional sale available while quantities last. ",
      "keyWords": [
        "available",
        "fresh",
        "fishmongers",
        "shuck",
        "toppings"
      ]
    },
    "second": {
      "name": "Joey Altman",
      "professionalTitle": "Television Celebrity Chef "
    }
  },
  {
    "first": {
      "title": "Curb Your Appetite",
      "description": "Experience a variety of Gourmet Food Trucks. The tastes are amazing and the price is right! Bring the family and enjoy a night out of the kitchen. Don't forget a blanket or chairs to relax and stay awhile. ",
      "keyWords": [
        "awhile",
        "appetite",
        "curb"
      ]
    },
    "second": {
      "name": "Janet Podleski",
      "professionalTitle": "Bestselling Author, Entrepreneur, TV Host \"Eat, Shrink & Be Merry\""
    }
  },
  {
    "first": {
      "title": "St Catharines Toastmasters",
      "description": "ST CATHARINES TOASTMASTERS a vibrant leadership and public speaking club in a positive environment. Guests are always welcome. We meet on the 1st and 3rd Thursday of every month from 5:30-6:30 pm, Normandy Resource Center, 111 Church Street. Free Parking. For more information: (905) 687 7175 or http://2196748.toastmastersclubs.org or call . ",
      "keyWords": [
        "public",
        "speaking",
        "club",
        "toastmasters"
      ]
    },
    "second": {
      "name": "Peter Legge",
      "professionalTitle": "Award Winning Motivation and Business Speaker"
    }
  },
  {
    "first": {
      "title": "Toronto Life Garden Party",
      "description": "Join Toronto Life and Toronto Botanical Garden for an exclusive intimate outdoor evening! Eat your way through Gusto 54’s delicious new catering menu followed by a special concert and guided garden tour featuring 17 different themed gardens. Dinner will include drinks, passed hors d'oeuvre, food stations and dessert. Originally from Sweden, Western Canadian Music Award winning artist Sarah MacDougall is becoming known for her honest and poetic songs, unique voice and passionate performances. Special meet and greet with Sarah during dinner. 5:30 p.m. Garden Party Dinner (Catered by Gusto 54) 7:00 p.m. Sarah MacDougall Concert (Reserved Seating) 8:30 p.m. Guided Garden Tour Toronto Botanical Garden 777 Lawrence Avenue East, Toronto Tickets $49 per person | $79 for two tickets LIMITED SUPPLY AVAILABLE! Please note: - Tickets are non-refundable - Event is rain or shine (indoor space available) - $79 ticket deal (will only need one of these printed tickets for two to enter the event) ",
      "keyWords": [
        "garden",
        "toronto",
        "tickets",
        "macdougall",
        "gusto",
        "hors"
      ]
    },
    "second": {
      "name": "James Theodore Farmer III",
      "professionalTitle": "Author, Gardener, Interior Designer, Cook"
    }
  },
  {
    "first": {
      "title": "Getting Started With Facebook Ads (Aug 20th)",
      "description": "It seems like everyone is talking about Facebook ads. About how they are phenomenally powerful for businesses, freelancers, and not-for-profits who want to build awareness, grow their email lists and ultimately, increase sales.  But how do you get started, and are they really worth all the hype? As your friendly neighbourhood-marketing strategist, I’m happy to say that I can help you get comfortable with the ideas behind Facebook ads. At the end of the session, you should be able to decide whether Facebook ads are a good fit for you and your business.   After this laser focused 3-hour session, you will be able to: Understand The Facebook Ads Mindset Approach Facebook ads with the right mindset (hint: this is where most beginners go wrong)See how other businesses have used Facebook ads to get results Draft Your First Campaign Strategy Understand the building blocks of a simple marketing funnel (the backbone of a successful Facebook ads campaign) Find your ideal customers on Facebook with a few ninja tricksCreate eye-catching ads with simple to use templates and free tools Know What Success Looks Like Understand what success looks like, and how to tell if your campaigns are working NOTE: In order to follow along, it is important for all attendees to bring their laptops with them ",
      "keyWords": [
        "Business",
        "Services",
        "Activities",
        "Social",
        "Online",
        "Media",
        "Media",
        "Arts",
        "Entertainment",
        "Business",
        "facebook"
      ]
    },
    "second": {
      "name": "Larry Chase",
      "professionalTitle": "Online Marketing Pioneer"
    }
  },
  {
    "first": {
      "title": "#InboundTO 29: SEO Deep Dive - Q&A Panel Session",
      "description": "Get ready for one of the best Digital Marketing Meetups of the year!! If you are interested in or work in Search Engine Optimization (SEO), and have nagging questions that need answers, then this session is for you!  Join us at InboundTO 29 on Thursday, August 20th for a Deep Dive Q&A Panel Session on SEO topics such as: • On-Page & Off-Page SEO • Technical SEO • LocalSEO and • General SEO  Add your questions on these areas to this shared google sheet under the headings that interest you, and we'll make sure that we cover as many questions as possible along with any related questions at our meeting. Please RSVP early to reserve your spot for the meetup. InboundTO charges a $10.00 admission fee.    SEO Deep Dive Q&A Panel: Anthony De Guzman, SEO Specialist at Saatchi & Saatchi \"I’m an SEO specialist based in the Toronto area. I have a strong background in technical SEO, App Store Optimization, PPC, Paid Social Advertising, and writing AdWords Scripts.\" Joy Hawkins, Local SEO Product Consultant at Imprezzio Marketing \"I've been working in the Local SEO industry since 2006 and enjoy making trips to Google as a part of their Top Contributor program and I currently contribute to many online communities\" Joy is active in these LocalSEO online communities: Google My Business forum (Top Contributor)Local University Forum (Moderator)Local Search Forum (Top Contributor)Moz Local Search Ranking Factors Survey (Contributor)Joy has also spoken on Local SEO at past SMX conferences put on by Search Engine Land and is speaking on 3 panels at the upcoming SMX East conference in NYC in October of this year. Andrew Ly, SEO Specialist at Powered by Search \"I'm an SEO specialist at Powered by Search. Prior to joining the industry, I taught myself SEO by starting my own websites and ranking them for various niches through mainly on-page optimization and content strategies.\" Andrew is also experienced with technical aspects of SEO such as structured data, site structure and improving the crawlability of websites.   AGENDA: • Introduction from the organizers (5mins) • Self Intros by SEO Panel members (5mins) • Deep Dive Q&A Session, Part1 (30 mins) • A catered networking break (15 mins) • Deep Dive Q&A Session, Part2 (30 mins) • A book giveaway (5mins) • Parting message from the organizers (5mins) The event will start at 6:15 PM and last for approximately 2 hours. Doors close at 6:15 PM due to limited seating and high demand. Please arrive at the venue around 6:00 PM to get a seat.   About InboundTO: Inbound Marketing Toronto is a monthly meetup focused on hot topics in the world of inbound marketing. The meetup hosts experts in the fields of Digital Marketing, including SEO & Local SEO, Social Media Marketing, UX Design, Graphic Design, PPC, CRO, CRM, Email Marketing, Content Marketing, Growth Hacking, and more. Join our monthly Meetup here. Sponsors: The event is sponsored by the inbound marketing agency Powered by Search and the innovation company BNOTIONS. Join the conversation on social media with: #InboundTO See you there!  Dat To, SEO Specialist at Powered by Search  @LocalSEODat ",
      "keyWords": [
        "seo",
        "marketing",
        "search",
        "crawlability",
        "smx",
        "saatchi"
      ]
    },
    "second": {
      "name": "Scott Wilson",
      "professionalTitle": "SEO speaker"
    }
  },
  {
    "first": {
      "title": "Service Design Toronto Thinks - Policy",
      "description": "Join us for an evening exploring the intersection of design and policy. In light of increased complexity in civic challenges and reduced resources to deal with them, what can design approaches bring to public policy issues? 6.30pm Doors 7.00pm Presentation: Alex Dirksen - Redesigning Democracy 7.50pm Workshop activity 8.30pm Mingling Snack and drinks on us! Alexander is a well-caffeinated strategist/policy wonk working at the intersection of technology, design and public policy. A graduate of the Munk School of Global Affairs, Alexander currently serves as User Experience Manager for Prollster (an EdTech startup based in Vancouver) and Operations Assistant for the Banff Forum (a growing community of Canadian public policy leaders).  Please arrive by 7pm as presentation will start at 7pm sharp and we will no longer be on the door. Refund policy: Refunds will be accepted up to 24 hours before the event.  Linn and Elina run Service Design Toronto to connect and grow the community. Elina is a designer at Healthcare Human Factors working on a mix of service design and user experience challenges. Linn is a designer at Usability Matters, where she solves complex problems across industries and platforms. ",
      "keyWords": [
        "public",
        "policy",
        "issues",
        "intersection",
        "design",
        "service",
        "design",
        "public",
        "policy",
        "presentation"
      ]
    },
    "second": {
      "name": "Majora Carter",
      "professionalTitle": "Activist for Environmental Justice"
    }
  },
  {
    "first": {
      "title": "Politics, Strategy and Insight - An Evening with Jaime Watt",
      "description": "Ladies and Gentlemen - set within one of Canada’s oldest private clubs founded by Sir John A. Macdonald (Canada's first Prime Minister and the Father of Confederation), join us for a fun-filled evening of interesting political dialogue, federal election discourse, networking and strategizing with one of Canada's most renowned political commentators, strategists and advisors - Mr.  Jaime Watt.   Jaime Watt is the Executive Chairman of Navigator Ltd. and Principal at ENsight Canada. He specializes in complex public strategy issues. He is also a trusted advisor to business leaders as well as political leaders at all three levels of government across Canada and has led ground-breaking election campaigns that have transformed politics in Canada. Jaime is a regular contributor to the CBC, including his own segment on the popular Power and Politics program, Sunday Scrum with Nancy Wilson, and on its flagship news program The National with Peter Mansbridge. Tickets are limited. ",
      "keyWords": [
        "jaime",
        "canada",
        "political",
        "mansbridge",
        "ensight",
        "strategizing"
      ]
    },
    "second": {
      "name": "Angela McGlowan",
      "professionalTitle": "Founder/President of Political Strategies and Insights, Author, Fox News Channel contributor"
    }
  },
  {
    "first": {
      "title": "Capital Markets, Insights and Perspectives",
      "description": "This information session will provide economic and market analysis, as well as a discussion on current events that  may affect your investment strategy for the remainder of 2015. Appetizers and beverages will be provided. ",
      "keyWords": [
        "Business",
        "capital",
        "markets",
        "economic",
        "market",
        "analysis"
      ]
    },
    "second": {
      "name": "Steve Cortes",
      "professionalTitle": "CNBC contributing commentary, author and investment advisor"
    }
  }
]
