[{"first":{"title":"Always ABBA","description":"The legend of ABBA lives on with timeless tunes, and this Swedish supergroup is as popular today as it was in the 70s! Come hear your favourite classic pop hits and dancefloor favourites recreated in the original style! Familiar to generation after generation, never in the history of pop music has one group been so celebrated and admired!Grab a friend and grab a table for an epic evening of ABBAs best hits, including: Mamma Mia; Knowing Me, Knowing You; Does Your Mother Know; Chiquita; Waterloo; S.O.S.; Fernando; Gimme, Gimme, Gimme; and Dancing Queen. ","keyWords":["Arts","Entertainment","abba","classic","pop","hits"]},"second":{"name":"Alan November","professionalTitle":"Empowering Students With Technology; Founder of November Learning"}},{"first":{"title":"Mary Poppins","description":"Everyone\u0027s favourite practically perfect nanny takes the stage in this Supercalifragilisticexpialidocious musical adventure!One of the most popular Disney movies of all time is capturing hearts in a whole new way: as a practically perfect musical! Based on the books by P.L. Travers and the classic Walt Disney film, Disney and Cameron Mackintosh\u0027s Mary Poppins delighted Broadway audiences for over 2,500 performances and received nominations for nine Olivier and seven Tony Awards, including Best Musical! ","keyWords":["musical","disney","perfect","poppins","travers","olivier"]},"second":{"name":"George Couros","professionalTitle":"Education\u0027s Innovative Thought Leader and Social Media Expert"}},{"first":{"title":"Magnetic Beats","description":"Dance to the beat, every week!Magnetic Beats is a social and interactive series combining urban dance and music in one space, every Friday. This series initiates meaningful artist collaboration and social opportunities for emerging Toronto artists and audiences – all on the dance floor! ","keyWords":["Media","Arts","Entertainment","interactive","series","urban","dance","music","artist","collaboration"]},"second":{"name":"Christine Sinclair","professionalTitle":"All-Time Leading Goal Scorer, Canadian Women’s National Soccer Team"}},{"first":{"title":"No.9 Eco-Art-Fest 2015","description":"Toronto\u0027s Historic Sites, in partnership with No. 9: Contemporary Art \u0026 the Environment, are pleased to present the return of the outdoor summer-long Eco-Art-Fest. The festival includes public art installations by Canadian artists, art activities for families and all ages, guided art tours, and musical performances in a licensed outdoor space. The goal is to bring awareness to environmental issues and promote a sustainable lifestyle, while re-imagining how one learns about a historical site through contemporary art programming.Visit www.no9.ca/ecoartfest for details. ","keyWords":["art","eco-art-fest","outdoor","learns","installations","guided"]},"second":{"name":"Dr. Mark DeVolder","professionalTitle":"Top 5 Speaker USA 2010-2013 - The Change Specialist"}},{"first":{"title":"Food Festival","description":"Relax and enjoy a delicious meal outdoors under the Club Roma Gazebo and then work off your meal with some dancing. For $60 a person you will enjoy Wine and Beer all night along with these traditional Italian food stations: Antipasto, Pasta, Meat, Seafood, Side Dish and Dessert! Reserve your seat by calling the Club! ","keyWords":["Food","Cooking","food","festival","traditional","italian","food","stations","delicious","meal"]},"second":{"name":"Ted McCain","professionalTitle":"Educational Futurist and Technology Guru"}},{"first":{"title":"Drop by The Sherway Farmers\u0027 Market Every Friday for Fresh Ontario Produce","description":"Shop local at Sherway Farmers’ Market and discover a tradition that has been in operation for over 20 years! Find fresh, seasonal and local produce and locally made food products from the market’s vendors at a great price at Sherway Farmers’ Market, open every Friday, rain or shine, beginning Friday May 8 until Friday October 30 from 8am until 2pm in the far northeast parking lot of Sherway Gardens, bordering on the Queensway and Sherway Rd., just east of Hwy 427. Visit www.farmfreshmarkets.ca for more information.Get ready for Spring and get your garden started with large-pot perennials and hanging baskets. Early Spring crops such as asparagus and rhubarb will be arriving at the Sherway Farmers’ Market in the coming weeks, and shoppers can pick up fresh Ontario-grown greenhouse tomatoes, cucumbers and peppers. There is something for everyone at Sherway Farmers’ Market including Ontario grown fruit and vegetables plus farm-fresh eggs, fresh baked goods, honey, deli meat, cheese, locally grown mushrooms and much more!If you are curious when your favourite fruit and vegetables will arrive at Sherway Farmers’ Market this season, visit the ‘Ontario Produce Availability’ chart at www.farmfreshmarkets.ca for a month-by-month overview of what is coming into season.Additional local food available at the Sherway Farmers’ Market weekly includes Ontario honey, an extensive array of baked goods, farm-fresh eggs, European deli meats, cheese and much more.To provide added value for customers, Sherway Farmers’ Market has created an app for iPhone, iPad and android devices called Farm Fresh. This FREE download lets you keep your shopping lists, for the market and the grocery store, right on your phone. The free Farm Fresh app can be downloaded at www.farmfreshmarkets.ca and can be found on iTunes and Google Play.For seasonal updates on vendors, produce and product availability, visit www.farmfreshmarkets.ca and follow Sherway Farmers’ Market on Facebook at www.facebook. ","keyWords":["sherway","market","farmers","ipad","iphone","queensway"]},"second":{"name":"Allison Massari","professionalTitle":"Personal Development Expert, Trusted Executive Coach"}},{"first":{"title":"Trade Compliance Seminar in Buffalo \u0027International Logistics\u0027","description":"Seminar Information:  Take the fear out of international shipping.  Learn to control your international shipments by directly coordinating your documents with transportation rules and procedures.  This seminar is an overview of the air and ocean transportation process.  Registration includes a copy of \"Managing Forwarders, Brokers \u0026 Carriers In Your International Supply Chain\" reference book.  Classes Earn NCBFAA credits. Register 30 days in advance and save$50! Early registration price is $545 per person.    Late registration price is $595  Instructor:  Trudy Wilson Who can attend:  Import \u0026 Export Managers, Traffic department, Sales, Shipping Department Personnel, International Marketing Managers, Customer Service Staff, Credit Managers, Controllers, Purchasing, Logistics Specialists or Anyone involved or with the responsibility for International Documentation, Compliance Rules and Regulations. To register or for more information, please visit:  http://www.globaltrainingcenter.com/buffalo-ny-international-trade-seminars Global Training Center (800) 860-5030","keyWords":["international","seminar","registration","forwarders","trudy","coordinating"]},"second":{"name":"Bobby Bowden","professionalTitle":"All-time winningest NCAA FBS coach (377)"}},{"first":{"title":"Career Kickstart: Are You Ready for the Fall Job Season?","description":"JOIN US Friday, August 21st, for “CAREER KICKSTART” : Are you ready for the Fall job market? Get a jump on the Fall job market with these two advanced career and personal branding workshops.  Lunch is included and provided by NABS. CAREER ACTIVISM: How to access the hidden job market 10:00-11:30 AM Keynote Presenter: M. Michelle Nadon, CEO, mediaINTELLIGENCE.ca mI\u0027s CAREER ACTIVISM seminar is designed to teach participants how to properly research and access the \"hidden job market\". In this seminar, we teach participants how to research and target companies properly, how to match their skills to a given business unit and company mandate, how to effectively approach decision makers for consideration on their team, and how to make a strong business case for their candidacy. We’ll show them easy, practical ways to plan an effective job search, how to develop job leads through their professional and personal networks, and most critically, they will learn how to assess if they have what it takes to be shortlisted for a given job. Finally, we\u0027ll give participants some practical direction on how to call, email and follow-up properly on job leads, and how to get in front of the right decision-maker, at the right time, for the right reasons.   Networking Lunch: 11:30-12:45   A light lunch will be provided by sponsor NABS; The National Advertising Benevolent Society (NABS) is a dynamic support system for all Canadian professionals in the marketing and communications industry facing personal, career and family challenges.   PERSONAL BRANDING WITH DIGITAL TOOLS: How to manage your digital brand 12:45-2:00 PM Presenter: Christine McGlade, CEO, analyticalengine.ca Digital Tools like blogs, social media, and scheduling software have made marketing yourself easier - and more complex - than ever. Learn some quick start tips and tricks to prioritise your marketing efforts, and maintain a consistent online presence without falling down the black time-sucking hole of social media distraction!  Get focused and get hired. Location: Centre for Social Innovation, 720 Bathurst St. (just south of Bloor West) Room: The Garage Cost: Early Bird $79.99 (plus HST to August 15th) Regular Rate: $99.99 (plus HST) Join us on August 21…and get the edge on the fall hiring season! ","keyWords":["job","career","personal","nadon","mcglade","shortlisted"]},"second":{"name":"Jeff Saturday","professionalTitle":"Super Bowl XLI Champion"}},{"first":{"title":"Getting More Local Customers Workshop: FREE Training for Small Business Owners","description":"Main Street Hub presents: Getting More Local Customers to Your Restaurant or Storefront   Do you run a small retail business? Are you a restaurant operator in a growing and diversified community? This free workshop is not one you\u0027ll want to miss. In today\u0027s digital world, leveraging the right social media and customer review site tools can make or break your local business. RSVP here for our FREE event on August 21st:   Learn what to do to market your restaurant or retail shop to NEW customers in the SAME city.  Proven best practices for leveraging online customer review sites for more customers Information about the ins and outs of Yelp, TripAdvisor and other popular review sites Basis and advanced steps for using social media sites and how to protect your reputation Connect with like-minded business owners over complimentary snacks!   Here is the agenda:   10:00am - 10:45am: Educational workshop with complimentary snacks. 10:45am - 11:00am Q\u0026A   This store is on the lower level next to Fossil and across from Sephora.     ","keyWords":["customers","business","sites","sephora","yelp","storefront"]},"second":{"name":"Deborah Kimmett","professionalTitle":"Second City Veteran and Expert on Communication and Change"}},{"first":{"title":"Kensington Krawl Food Tour","description":"Taste your way through Toronto\u0027s most unique and eclectic neighbourhood on a culinary excursion in Kensington Market. As we stroll, you will learn about the history and heritage of the market, meet local shopkeepers and chefs, and indulge in variety of delicious foods and drinks.What\u0027s included?6 generous tastings + alcoholic beverageFor more information and to get tickets, visit savourtoronto.com ","keyWords":["kensington","market","shopkeepers","tastings","indulge"]},"second":{"name":"Col. Greg Gadson","professionalTitle":"Decorated Army Commander and New York Giants Honorary Captain"}}]