[
{
      "title":"Benefits and Disability Management West 2015: From Research to Action",
      "description":"“Errors using inadequate data are much less than those using no data at all.” “Knowledge is not simply another commodity. On the contrary. Knowledge is never used up. It increases by diffusion and grows by dispersion.” Babbage and Boorstin got it right. Data does matter, and when used effectively can help your organization be more productive and cost effective, and attractive to employees and investors. In today’s rapidly changing economy, with benefit costs rising, an aging population, new breakthroughs in specialty medications, and the ever present need to manage costs, accurate information on which to base your benefit plan design and attendance and disability management decisions is essential. This event is your source for that information. Learn from the Conference Board’s latest research in benefits benchmarking and specialty medications! Be the first in Western Canada to hear the results of the Conference Board’s newest benefits benchmarking study. This survey of hundreds of Canadian employers will give you a wealth of real-world data and experience to draw upon. Key findings from the survey will include: benefits plan priorities costs and funding issues trends and innovations in plan design coverage changes for current employees and retirees transition of the benefits function within organizations You’ll also hear some of the key highlights of the Board’s recently released study on the ROI of specialty medications. Discuss the critical issues and decisions facing employers, and the potential options. Learn how others are maximizing health and well-being, while holding the line on costs. This year’s conference is rich with evidence-based insights and practical advice, to help you build successful and cost effective initiatives. Employers and thought leaders will examine how you can improve your organization’s benefits and absence and disability management practices. Are your benefits working as hard as they can for your organization? Top employers will highlight key aspects of their benefit plans, and share their insights on what works and what doesn’t in plan design. Does your wellness strategy address today’s greatest challenges? Experts will share their thinking on substance use and abuse issues for employers, and options for the return to work by employees dealing with addictions. You’ll also hear about the drivers of benefit costs, and opportunities to better manage those costs.  Learn more Learn more"}
]
