[
         {
            "name":"Lori Ann Bender",
            "professionalTitle":"Strategic Transformation Specialist, Business Intelligence and Innovation, Export Development Canada",
            "pages":[
               "http://www.conferenceboard.ca/conf/govrisk/agenda.aspx"
            ]
         },
         {
            "name":"John Brewer",
            "professionalTitle":"Executive Program Developer, The Conference Board of Canada",
            "bio":"John Brewer is the owner of Idea Exchange, and has over 20 years\u0027 experience producing conferences on change, human resources, diversity, IT, pensions, risk, compensation, and project management. John has been developing events for The Conference Board of Canada since 2000. His current focus is on innovation, diversity, community, and the human aspects of change and risk management.",
            "pages":[
               "http://www.conferenceboard.ca/conf/govrisk/agenda.aspx"
            ]
         },
         {
            "name":"John Burrett",
            "professionalTitle":"President, Haiku Analytics",
            "bio":"John Burrett began his career as an economist, program evaluator and policy analyst with the Government of Canada, immersed in data and analytics. Later, working with mayors and councilors of cities across Canada and closely with the late Jack Layton, John got a crash course from the best on communicating facts, figures and positions.John has continued to study with leaders in data visualization and professional presentation design, including Stephen Few and Duarte Design, California, and delivers presentations and workshops on these methods. In his consulting practice, he develops effective products and tools for his clients in fields like public relations, policy, evaluation and research.",
            "pages":[
               "http://www.conferenceboard.ca/conf/govrisk/agenda.aspx"
            ]
         },
         {
            "name":"John G. Delaney",
            "professionalTitle":"Risk Manager, Naval Integrated Risk Management, Department of National Defence, Royal Canadian Navy",
            "bio":"John Delaney is the Manager of Naval Integrated Risk Management with the Royal Canadian Navy. John is a Certified Internal Auditor (CIA) with 26 years\u0027 combined experience in Internal Audit, Control Self-Assessment, Strategic Planning and Integrated Risk Management. He has earned the Canadian Risk Management (CRM) certificate and Certification in Risk Management Assurance (CRMA). John\u0027s interest in Risk Management began in 2002 having been introduced to the Australian/New Zealand Standard on Risk Management (AS/NZ 4360:1999). He used this standard to design and deploy workshops within the Navy enabling teams to quantify, qualify and mitigate the risks associated with meeting their work objectives. John\u0027s current task is to build a Risk Management System across the Navy.",
            "pages":[
               "http://www.conferenceboard.ca/conf/govrisk/agenda.aspx"
            ]
         },
         {
            "name":"John Findlay",
            "professionalTitle":"Founder, Launchfire",
            "bio":"John Findlay is a founding partner of the gamification shop, Launchfire. Early in life John showed promise in the non-existent field of gamification making games out of everything from homework to chopping wood. Stuck with the unenviable task of training upper management to use SAP John discovered a professional use for his otherwise useless proclivity. He found that by gamifying the training courses he was able to get folks more engaged. At this point he knew he was on to something.At Launchfire John has developed gamified training programs for the likes of Dell, Intel, Microsoft, Jet Blue, Marriott and more.",
            "pages":[
               "http://www.conferenceboard.ca/conf/govrisk/agenda.aspx"
            ]
         },
         {
            "name":"Ann D. E. Fraser",
            "professionalTitle":"Executive Director, Program, Policy and Planning, Canadian Food Inspection Agency",
            "bio":"Dr. Ann D.E. Fraser began her career in the Canadian Public Service in 1984 as a research scientist studying foodborne pathogens at what is now the Canadian Food Inspection Agency\u0027s (CFIA\u0027s) Ottawa Laboratory. With the CFIA since its creation in 1997, Ann has held a number of positions at the Executive Director level including ED Policy, Planning and Coordination Directorate, and ED Laboratories Directorate and ED Science Strategies Directorate in the Science Branch. In 2003 she was asked by the then President to lead a process to articulate the Agency\u0027s revised Values Statements which were launched in 2005; in the same year she was asked to lead a process to articulate the Agency\u0027s Vision and Mission statements, which were launched in 2006. While these initiatives were in addition to her day job, in October 2006 Ann took on a full time assignment at the request of the President to develop and implement a values and ethics strategy for the CFIA. She also supported the Agency\u0027s first Senior Integrity Officer by developing the internal disclosure (whistle blowing) policy, as well as associated processes and communication and training materials. In April 2011 Ann became the Executive Director of the Agency\u0027s Values, Integrity and Conflict Resolution Directorate which is responsible for values and ethics, internal disclosure, the informal conflict management system and conflict of interest.Ann is very active interdepartmentally co-chairing the Government of Canada\u0027s Interdepartmental Network for Values and Ethics and the Internal Disclosure Working Group, among others. She is an active member of the Ethics Practitioners\u0027 Association of Canada having organized 8 half day ethics workshops. She is a member of the Society of Corporate Compliance and Ethics and had her first ethics publication in Ethikos in September 2014.",
            "pages":[
               "http://www.conferenceboard.ca/conf/govrisk/agenda.aspx"
            ]
         },
         {
            "name":"Mohamed Ismail",
            "professionalTitle":"Principal Risk Advisor, Toronto Transit Commission",
            "bio":"Mohamed Ismail is the Principal Risk Advisor for the Toronto Transit Commission (TTC), North America\u0027s third largest transit organization. He is leading the development and implementation of Enterprise Risk Management, a key initiative of TTC\u0027s modernization effort. Before embarking on a career in risk management, Mohamed built extensive experience in operations management and in senior positions managing large scale public sector projects. He also teaches Operational Risk at the University of Toronto\u0027s School of Continuing Studies.",
            "pages":[
               "http://www.conferenceboard.ca/conf/govrisk/agenda.aspx"
            ]
         },
         {
            "name":"Nick Martyn",
            "professionalTitle":"Founder and Chief Executive Officer, RiskLogik",
            "bio":"Nick Martyn is the Chief Executive Officer of RiskLogik. After 27 years as a combat arms officer, serving in a variety of operational and staff roles at the tactical, operational and strategic level of the Canadian Armed Forces, Nick was selected to serve on the Strategic Advisory Team Afghanistan where he was part of the team that gained World Bank and IMF approval for the Afghanistan National Development Strategy at the Paris 2008 donor conference. Retiring from military service in 2008 he returned to Afghanistan as the Executive Director and Chief Executive Officer of the Afghanistan Information Management Service where he designed and implemented NeXus, a geo-enabled program management system that manages Afghan infrastructure reconstruction projects. In 2010, in response to the failures in International Development Project Management he observed in Afghanistan, Nick co-founded the MBA for International Development Management program at Carleton University. Returning to Canada in 2011 he founded RiskLogik, a decision support software company delivering risk intelligence solutions to global clients. Nick\u0027s work on risk and resilience has been published in several journals.",
            "pages":[
               "http://www.conferenceboard.ca/conf/govrisk/agenda.aspx"
            ]
         },
         {
            "name":"Jan Mattingly",
            "professionalTitle":"President, RiskResults Consulting Inc.",
            "pages":[
               "http://www.conferenceboard.ca/conf/govrisk/agenda.aspx"
            ]
         },
         {
            "name":"Lesley K Thomson",
            "professionalTitle":"UEP Business Strategist, The City of Calgary",
            "pages":[
               "http://www.conferenceboard.ca/conf/govrisk/agenda.aspx"
            ]
         }
      ]
