[
{
      "title":"Canadian Food \u0026 Drink Summit 2015: Measuring Performance, Taking Stock, Inspiring Action",
      "description":"The Conference Board’s Centre for Food in Canada (CFIC) is hosting this major 2-day event to explore the future of Canada’s food sector, and leverage new opportunities to enhance the great economic potential of our food sector performance—both domestically and globally. This unique event is bringing together a wide range of stakeholders from the entire food system—attracting 200–300 participants from across Canada and around the world. Food impacts Canadians in an extraordinary range of ways: it affects our lives, our health, our jobs and our economy. There is a new urgency to safeguard and sustain the health and profitability of the producers, manufacturers, shippers, traders, distributors and retailers in Canada’s food system, who are pivotal to ensuring the quality, healthiness and safety of the food supply to Canadians. Canadian Food and Drink Summit 2015 focuses on how collectively, as well as individually, we can make the most of our plentiful resources and opportunities in the food sector while enhancing healthy food, improving food safety, environment sustainability, and addressing the challenges of household and global food security. We are assembling an outstanding lineup of Canadian and international experts to share innovative insights and solutions to help improve our food sector performance—ensuring we make the most of our resources, talent, and brand reputation to better meet the food needs of Canadians and people all over the world. The Summit will feature the launch of the Conference Board’s 1st Annual Report Card on Food—Performance and Potential—our first-ever assessment of Canada’s national food performance compared to other leading countries. The Report Card will evaluate five elements (industry prosperity, healthy food, food safety, household food security, and environmental sustainability), and will provide top line results comparing Canada’s performance to the world. Connect with key leaders and major food sector players from across Canada. Network, ask questions, and build relationships with—expert speakers, business leaders and decision makers, government officials, civil society, academics and students. Expand your network of food connections to take your performance to the next level. Join us to celebrate and experience some of Canada’s finest foods and drinks. We will be featuring some of Canada’s most renowned food products, cuisine, drinks, and local produce throughout the Summit. Don’t miss the Networking Reception at the end of Day 1! Summit participants will be invited to share their views and insights, and take part in an interactive consultation session to identify key provincial food metrics. Insights will be captured by rapporteurs, and used in the development of a future Provincial Report Card on Food that will measure and track the food sector’s annual progress to help enhance food sector performance across Canada. The Canadian Food and Drink Summit 2015 will feature compelling topics such as: More Protein for the World: Leveraging Canada’s Food Reputation and Increasing Global Exports Canada Feeding the World: Tackling the Global Food Security Challenge Ramping Up Culinary Tourism in Canada: Promoting our National Food and Drink Through Edible Experiences Exporting to Asia: Market Opportunities and Partnership Creation Developing an Animal Welfare Code for Canadian Food Sectors Latest from the Conference Board’s Industrial Outlook on Food: Manufacturing and Services Human Resources in the Food Sector: Talent, Management Skills and Succession Planning Renewing Canada’s Food Guide Delegate Consultation on Provincial Metrics: Developing a Provincial Report Card on Food Food Defense: Building Resilience for Future Emergencies Innovation in the Beverage and Drink Industry: Key Canadian Changes and Trends to Watch Enacting a Better Solution to Eliminate Food Waste in Canada Industry Prosperity—Increasing the output and profitability of Canada’s food industry to contribute to national economic growth and our global competitiveness. Healthy Food—Improving the health of food products and the diets of Canadians as obesity and chronic diseases become an increasing concern. Food Safety—Ensuring that food safety is maintained throughout the supply chain as globalization grows. Food Security—Improving food security to ensure that all Canadians have access to safe, affordable, and nutritious food. Environmental Sustainability—Sustaining the environment while increasing agricultural output as countries seek to feed their rapidly growing populations. We’d like to thank our generous sponsors for their contribution to this event.   Past Sponsors of the Canadian Food Summit Learn more"}
]
