[{"first":{"title":"ICFSummit2015","url":"http://www.eventbrite.ca/e/icfsummit2015-tickets-15850833269","description":"The ICF Summit is an international gathering of mayors, chief administrative officers, chief information officers and economic development officers from cities, states and regions around the world. It is a unique opportunity to learn from the world\u0027s most dynamic communities how to use information and communications technology to build prosperous, inclusive and sustainable communities. The 2015 Summit will take place in Toronto, one of the worlds top cities not only for business investment and economic competitiveness but for livability as well  and ICFs 2014 Intelligent Community of the Year.  Attendees will benefit from an expanded program that explores the projects, strategies and institutions of this major metropolitan area as well the cities and technology centers that surround it. What will you learn at the Summit? The Summit features economic development matchmaking, Master Classes, Plenary sessions and the Intelligent Community Awards, including selection of the 2015 Intelligent Community of the Year.  Social and networking events create an intimate atmosphere where productive relationships are forged and new ideas arise. This Years Theme: The Revolutionary Community In 2015, the Intelligent Community Forum will focus on the study of urban and regional planning and how it is impacting the way people live, work and create in their cities and towns. The work of creating an Intelligent Community often begins in crisis. But once the crisis is past, how do Intelligent Communities maintain their momentum?","time":{"start_date":"08/06/2015","start_time":"9:00 AM","end_date":"012/06/2015","end_time":"3:30 PM"},"organizer":{"name":"Intelligent Community Forum Canada","contact":{"twitter_handle":"https://twitter.com/Newcommunities","twitter_url":"@Newcommunities","facebook_url":"https://www.facebook.com/IntelligentCommunityForum","website":"https://www.intelligentcommunity.org/","email":"icf@intelligentcommunity.org","phone":"+1 (646) 291-6166"}},"venue":{"name":"Waterfront Toronto","address":{"street_number":"20","route":"Bay Street","locality":"Toronto","administrative_area_level_1":"ON","country":"Canada","postal_code":"M5J 2N8"}},"keyWords":["community","intelligent","cities","livability","icf","mayors","Toronto"]},"second":{"name":"Merge Gupta-Sunderji","professionalTitle":"Turning managers into leaders - specific and practical tools for leadership success","topics":["Business \u0026 Workplace","Innovation \u0026 Change Management","Performance \u0026 Productivity"],"bio":"Merge Gupta-Sunderji has been turning managers into leaders for over 20 years. Tens of thousands of audience members from around the world have participated and enjoyed the experience of learning through Merge’s presentations. As a professional speaker, author, consultant, and radio commentator, she delivers real-world, practical tools and solutions to ensure her clients have what they need to LEAD in today’s competitive world. She’ll empower, engage and inspire your audience to lead with confidence, competence and courage."}}]
