[{"title":"Towards a Canadian Energy and Environment Strategy","description":"The energy sector has always been subject to degrees of uncertainty, but the current position of Canada\u0027s energy sector is as volatile as it has been in years, even decades. It is becoming increasingly difficult for Canada to move major energy projects forward and to help Canada shift to a cleaner energy future. Given the important role energy plays directly and indirectly in Canada\u0027s economy, as well as the impact that it has on the environment and society as a whole, Canada needs a responsible, well-informed dialogue on the range of issues flowing from the energy sector. The Conference Board of Canada believes that a holistic approach, involving multiple stakeholders across the full spectrum of the energy industry, can advance a Canadian energy and environment strategy. It is for this reason that we are holding this important event which we hope will serve as a platform to launch a new initiative in this area: The Centre on Energy, Environment and Economy to help move a strategy forward in earnest. Given the important role energy plays directly and indirectly in Canada\u0027s economy, as well as the impact that it has on the environment and society as a whole, Canada needs a responsible, well-informed dialogue on the range of issues flowing from the energy sector. The challenges are widespread: new global competitors including the United States itself, a supply glut in oil and natural gas, the influence of the environmental movement (in Canada and globally), public opposition to new development and transportation projects, Aboriginal rights, labour shortages in the sector, and the effectiveness of regulatory approaches are just some of the many challenges facing the industry. The energy sector—which includes oil, natural gas, hydroelectricity, nuclear energy and renewables—is under a number of pressures. The rise of the global environmental movement since the 1970s has helped to increase concerns about the overall environmental footprint of energy production, transmission and consumption, including oil and gas, nuclear and even hydro-electric power. Greenhouse gas emissions are becoming an increasing concern on the international stage, putting more pressure on Canada to show that it can lower carbon emissions Aboriginal communities have increased influence on future development of energy projects. Market access has long been a major issue for electricity generators, with provincial boundaries often acting as barriers to cleaner and more affordable power. More recently, opposition has risen against additional crude oil pipeline capacity to open new markets for rising oil sands production. A critical factor is balancing the risks and rewards of these projects across affected regions. A lack of pipeline capacity has contributed to Western Canadian oil producers receiving less than North American and world prices for their oil, a phenomenon made all the more painful by the recent, across the board decline in crude oil prices. At the same time, energy projects in Western Canada have suffered significant upward price pressures, partly due to a shortage of skilled labour. Concerns about the environmental impact of hydraulic fracturing have lead to moratoriums against shale resource development in New Brunswick, Nova Scotia and Quebec. Surveys indicate that trust in the ability of governments to manage these complicated issues is waning. This conference is an opportunity for you to have a voice at the table to help advance a Canadian energy and environment strategy. This event is by invitation only and registration fees have been paid for by the generous support of our Partners. If you haven\u0027t received an invitation but would like to be considered, please contact Mary Jane Curren at curren@conferenceboard.ca or by phone at 613-526-3090 ext. 351. View it now"}]
