[{"name":"Philippe Benoit","professionalTitle":"Acting Director, Directorate of Sustainable Energy Policy and Technology, International Energy Agency","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Tzeporah Berman","professionalTitle":"Adjunct Professor, Faculty of Environmental Studies, York University","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Michael Cleland","professionalTitle":"Senior Fellow, University of Ottawa\u0027s Positive Energy Program, University of Ottawa","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Len Coad","professionalTitle":"Research Director, The Conference Board of Canada","bio":"Len Coad is Director, Energy, Environment and Technology Policy for the Conference Board of Canada. Len joined the Conference Board of Canada in 2006 in the Public Policy Division. His duties include business development for the Western Office as well as managing the Energy, Environment, and Technology Policy research program. Len\u0027s current focus areas include climate change, climate change adaptation, water governance, sustainability, environmental benchmarking, energy policy, and effective regulation.Prior to joining the Conference Board of Canada, Len worked in a variety of research, government and commercial roles in the energy industry. He has extensive experience in energy forecasting, competitor analysis, policy development, and energy modelling. Len has done energy policy studies, regulatory studies, and project evaluations for various regions in North America, as well as internationally. He holds an Honours Degree in Economics and a Masters Degree in Operations Research.","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Vicky Cole","professionalTitle":"Division Manager, Partnerships and Stakeholder Initiatives, Manitoba Hydro","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Frank Des Rosiers","professionalTitle":"Assistant Deputy Minister, Innovaton and Energy Technology Sector, Natural Resources Canada","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Stewart Elgie","professionalTitle":"Professor, University of Ottawa","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Maxime Faille","professionalTitle":"Partner, National Leader, Aboriginal Law Group, Gowling Lafleur Henderson LLP","bio":"Max Faille is a partner at Gowlings LLP, practicing in Aboriginal and constitutional law, and is national leader of Gowlings\u0027 Aboriginal Law Group. His clients consist of First Nation, Inuit and Métis communities across Canada, and private sector entities doing business with Aboriginal communities. Max has received numerous recognitions, including Chambers Global - World\u0027s Leading Lawyer for Aboriginal Law in 2013, 2014 and 2015, as well as the Lexpert Leading Lawyers Guide (Aboriginal Law, Energy Law and Mining Law) and Benchmark (Litigation Star - Aboriginal Law). He is a member of the Board of Directors of the Canadian Council for Aboriginal Business.","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Dawn Farrell","professionalTitle":"President and Chief Executive Officer, TransAlta Corporation","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Phil Fontaine","professionalTitle":"Founder and President, Ishkonigan Inc.","bio":"Phil Fontaine is the Founder and President of Ishkonigan Inc. Phil has also served as National Chief of the Assembly of First Nations for an unprecedented three terms. He is a Member of the Order of Manitoba and has received a National Aboriginal Achievement Award, the Equitas Human Rights Education Award, the Distinguished Leadership Award from the University of Ottawa, the Queen\u0027s Diamond Jubilee, and most recently was appointed to the Order of Canada. Phil also holds fifteen Honorary Doctorates from Canada and the United States.","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Monica Gattinger","professionalTitle":"Chair, Collaboratory on Energy Research and Policy, University of Ottawa","bio":"Dr. Monica Gattinger is Chair of the University of Ottawa\u0027s Collaboratory on Energy Research and Policy, which seeks to strengthen research and policy capacity on salient energy issues in North America. She is Associate Professor at the University of Ottawa\u0027s School of Political Studies, and has written widely on Canadian energy policies and the country\u0027s energy relations with the United States.Professor Gattinger is spearheading Positive Energy, a three year initiative bringing together industry, government, aboriginal groups and environmental NGOs to identify how to achieve social acceptance and support for energy development in Canada. She holds a PhD in public policy from Carleton University.","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"The Hon. Michael F. Harcourt","professionalTitle":"Former Premier of British Columbia, and Chair, QUEST (Quality Urban Energy Systems of Tomorrow)","bio":"Mike Harcourt served as Premier of British Columbia 1991-96 and prior to that mayor of Vancouver. Mr. Harcourt helped the province earn its reputation as one of the most liveable places in the world. After stepping down from politics, he was appointed by the Prime Minister to serve as a member of the National Round Table on the Environment and Economy. There, Mr. Harcourt served on the Executive Committee and Chaired the Urban Sustainability Program. He was also a federally appointed BC Treaty Commissioner and was Chair of the Prime Minister\u0027s Advisory Committee for Cities and Communities, mandated to examine the future of Canada\u0027s cities and communities. Mr. Harcourt is currently involved with numerous Boards including the University of British Columbia\u0027s Centre for Interactive Research on Sustainability, the Canadian Electricity Association\u0027s Sustainable Electricity Program Advisory Panel, the United Way\u0027s Public Policy Institute, Canada\u0027s ECOFISCAL Commission, and AGE-WELL Board.His exemplary career as Lawyer, Community Activist, and Politician has been honoured with the Woodrow Wilson Award for Public Service, Canadian Urban institute\u0027s Jane Jacobs Lifetime Achievement Award, and Order of Canada. Harcourt brings his experience and enthusiasm to the stage when speaking on the importance of creating vibrant, sustainable cities and communities.","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Gerry Kerr","professionalTitle":"President, Chignecto Consulting Group","bio":"Gerry Kerr has been President of Chignecto Consulting Group, a company that focuses on community development, business development and negotiation support for Aboriginal peoples and their institutions since 1996. Gerry is recognized as one of Canada\u0027s most experienced and successful negotiators with respect to concluding resource agreements between Aboriginal communities and proponent companies. He is a sought after key speaker and has been invited to many First Nation and industry conferences related to the Duty to consult and strategies for resource agreements. He has been involved in more than seventy Exploration and Impact Benefit Agreement negotiations including the Voisey\u0027s Bay Impact Benefit Agreement, the DeBeers Victor Diamond Project in the James Bay Lowlands and with Lutsel K\u0027e Dene First Nation in Northwest Territories in their negotiations on Snap Lake and Gahcho Kue Diamond Mines and with the Innu Nation in their negotiations with the Province of Newfoundland \u0026 Labrador on the Lower Churchill Hydro Projects.Prior to his consulting career, Gerry enjoyed a productive career within the federal government as a Regional Director. He was responsible for overseeing the delivery of the full range of Indian Affairs programs and services to First Nation, Innu and Inuit communities in Atlantic Canada and Ontario.","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Vincent Lauerman","professionalTitle":"Director, Energy, Environment and Transportation Policy, The Conference Board of Canada","bio":"Vincent joined The Conference Board of Canada to lead the Energy and Environment research team, oversee the Business Council for Sustainability executive network, and develop new energy-related conferences. Vincent has in-depth knowledge of macroeconomic and geopolitical issues, having worked as a world oil analyst for much of his nearly 30-year career.Prior to joining the Conference Board, Vincent was deputy bureau chief and senior oil markets economist at Energy Intelligence in New York, president of the Calgary-based consultancy Geopolitics Central, a consultancy focusing on international relations and geopolitics of energy, editor-in-chief of Geopolitics of Energy, and global energy analyst for the Canadian Energy Research Institute.Vincent has written extensively on international and North American oil and energy markets, oil and gas industry environmental issues, and the geopolitics of energy. He has also spoken on a wide range of topics at a number of international energy conferences, including the Aspen Institute, Centre for Global Energy Studies, Emirates Centre for Strategic Studies and Research, and the Windsor Energy Group.Vincent has developed a wide network of contacts in international energy organizations, such as the International Energy Agency, OPEC, International Energy Forum, and the U.S. Energy Information Administration. Vincent also has experience organizing and chairing world oil conferences.Vincent began his career with the Alberta Petroleum Marketing Commission in 1985. Vincent is a rare triple major-economics, political science, and sociology-at the undergraduate level, and holds a Masters degree in economics from the University of Alberta.","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Devin McCarthy","professionalTitle":"Director of Generation and Environment, Canadian Electricity Association","bio":"Devin McCarthy is the Director of Generation and Environment policy issues at the Canadian Electricity Association (CEA). Devin recently transitioned to this portfolio after three years as CEA\u0027s Director of Transmission and Distribution. In his current capacity he leads the Association\u0027s work in areas such as electricity system investment requirements, environmental stewardship, climate mitigation, climate adaptation and sector resiliency in the face of extreme weather events.Devin helps to shape and communicate industry approaches to these issues with a focus on high-level business impacts and consultation with key federal government departments.","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Shawn McCarthy","professionalTitle":"National Business Correspondent, Globe and Mail","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Sandra M. Odendahl","professionalTitle":"Director, Corporate Sustainability \u0026 Head of Social Finance, Royal Bank of Canada","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Louis Thériault","professionalTitle":"Vice-President, Public Policy, The Conference Board of Canada","bio":"Louis Thériault is the Vice-President, Public Policy for the Conference Board of Canada. Louis joined the Conference Board of Canada in 1997, where he specializes in product development and economic analysis. He is currently responsible for research and networks in the areas of national security and public safety, health (including Canadian Alliance for Sustainable Health Care), energy, environment and transportation policy and the Centre for the North.Formerly, Louis was the Executive Director, Economic Initiatives, responsible for all aspects of the Board\u0027s many research programs including the Canadian Alliance for Sustainable Health Care, Canadian Tourism Research Institute, Global Commerce Centre and the research liaison for the new Institut du Québec.Since joining the Conference Board, Louis has launched several initiatives. He was first responsible for the Metropolitan Outlook Service including a quarterly economic forecast for large Canadian urban centres. In 2003, he launched the Canadian Industrial Outlook Service providing economic and financial trends for large industries. Louis was also director of the International Trade and Investment Center, which offers Canadian business leaders and policy-makers research related to the implications of ongoing restructuring of global production. More recently, he led the Board\u0027s health economics group providing forward-looking, quantitative analysis of the sustainability of the Canadian health-care system.In addition, Louis is a speaker and a media spokesperson on topics related to health economics, international trade and investment and the Canadian economy.","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Stephanie Trudeau","professionalTitle":"Vice-President, Strategy, Communication and Sustainability, Gaz Métro","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Stephanie Trudeau","professionalTitle":"Vice-President, Strategy, Communication and Sustainability, Gaz Métro","bio":"Vice President at Gaz Métro since October 2012, Stéphanie Truedau was first responsible for Sustainability, Public and Governmental Affairs and in 2013 also for Marketing, Innovation and Customer Services. As a communications expert and strategist, Stéphanie is at ease with political matters, crisis management and risk communication. Her previous roles included Vice-President and Partner withTact Intelligence-Conseil; Vice-President, Public Affairs for Labatt - Québec; Director, Public Affairs for Québec\u0027s Société des alcools, and Director, Community Relations at Rabaska.Stéphanie sits on various boards, including Le Conseil patronal de l\u0027environnement and La Fondation québécoise en environnement. She is also a member of the Climate Change Advisory Committee and chairs the energy committee of Le Fédération des chambres de commerce du Québec.","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]},{"name":"Anthony Yuen","professionalTitle":"Director, Commodities Strategy, Citi Research","pages":["http://www.conferenceboard.ca/conf/15-0111/agenda.aspx"]}]
